// 배열은 for...of...

// 투표 결과 배열
let votes = [
  '이재식', '이재식', '이규하', '이규하', '이규하',
  '이재식', '이재식', '이규하', '이규하', '이재식',
  '이규하', '이규하', '이규하', '이규하', '이재식',
  '이재식', '이규하', '이재식', '이재식', '이재식',
  '이재식', '이재식', '이규하', '이규하', '이규하',
  '이규하', '이규하', '이재식', '이규하', '이규하',
  '이규하', '이규하', '이재식', '이규하', '이규하',
  '이규하', '이재식', '이재식', '이재식', '이규하',
];

// 후보별 득표수 객체
let voteCounter = {};

// 여기에 코드를 작성하세요
for (const item of votes) {
  if (item in voteCounter) {
    voteCounter[item]++;
  } else {
    voteCounter[item] = 1;
  }
}
// 테스트 코드
console.log(voteCounter);